---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSettings.GetStructuralSettings(Autodesk.Revit.DB.Document)
source: html/a1ca56a0-3d21-3824-aa38-d34174ffd727.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.GetStructuralSettings Method

Obtains the StructuralSettings object for the specified project document.

## Syntax (C#)
```csharp
public static StructuralSettings GetStructuralSettings(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - A project document.

## Returns
The StructuralSettings object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null